[
  {
    "path": "posts/2021-03-10-dataviz-makeover-03/",
    "title": "DataViz Makeover 03",
    "description": "DataViz Makeover 03 of ISSS608",
    "author": [
      {
        "name": "Tang Haozheng",
        "url": {}
      }
    ],
    "date": "2021-03-10",
    "categories": [],
    "contents": "\r\n1. Critiques For The Original Visualization\r\n\r\nThe current visualization can be found at below picture. The purpose of this chart is to reveal the overall situation of conflicts in South-East Asia region. And for this purpose, there are sevral improvements.\r\n1.1 Clarity Issues\r\n(1)For the map, the points are totally opaque, hence when there are overlapping points, it is hard for viewers to realize how many events happened in the area indeed.\r\n(2)For the tooltip of the points on the map, there is no need to add longitude and latitude there since viewers are not interested and not aware of the exact coordinates. Also, the event ID showed is also confusing for viewers because they would not understand the meaning of the code. And as these two issues, the information that the map conveyed is very poor and unhelpful for viewers.\r\n(3)For the line chart, it is unclear and no meanings for viewers to use “count of sheet1” as the title of y axis.\r\n(4)The title of x axis is “Event Data” while the value of x axis is in years.\r\n(5)Also, since color is already used as filter to differentiate the event types, there is no need to use separate line charts to indicate different event types. What’s more, the color of the line chart is all blue, therefore, it is unclear for viewers since the legend is here and blue refers to “Battles”.\r\n(6)From the point of my view, line charts are worse than bar chart. Because it only reveals the total number of each event happened, while it can not reveal the component structure of the events happened in a period.\r\n1.2 Aesthetics Issues\r\n(1)The structure of the line graph is too simple and make viewers think the information is kind of poor.\r\n(2)The font size and color of the titles in the line graph is small and indistinct.\r\n(3)The y axis of each line is not synchronized. It is hard for viewers to compare the numbers betweem different event types.\r\n(4)For some filtered results, the line chart is kind of uncomfortable for viewers. For example, this line disappears in 2017 and 2020 since the value of these years is zero.\r\n\r\n1.3 Interactivity Issues\r\n(1)The country filters is in single value list, hence it is impossible for viewers to select specific countries to do comparison.\r\n(2)There is no filter for years so it is hard for viewers to focus on the events happened in selected year or years.\r\n2. Proposed Design\r\n\r\n\r\nComparing to the original visualization, the proposed design overcome several issues:\r\n(1)“Years” is added as a filter in order that viewers can select the year or years that they want to focus on. Also, “Country” filter is set as multi value list so viewers can select different countries to do comparison.\r\n(2)For the “General Information” part, more useful information are added into the tooltip, which allows viewers to acknowledge more about the event. And the size of the circle is differentiated by the fatalities hence viewers can have a straightforward understanding of the severeness of the event. More importantly, I set the opacity of the circle to be 45% so it is clearer even if there is overlapping.\r\n(3)For the “No. of Conflicts” and “No. of Fatalities” parts, bar charts are added to make it more clear for viewers to know the event numbers and also structures in different countries. Since the difference of each country is relatively large so I did not add any reference line in the chart.\r\n3. Tableau Dashboard\r\n\r\n\r\n\r\n4. Step-by-step Description\r\n4.1 Importing data into Tableau\r\nThe data is already well structured so there is no need to change any content or format of the original csv file. Directly load the data into tableau.\r\n\r\n4.2 For the “General Information” part\r\nFirst of all, we drag the existed measure value “Longitude” on columns and “Latitude” on rows instead of using the longitude and latitude that talbeau automatically generatede for us.\r\n\r\nThen we drag “Event Id Cnty” to detail and the graph should look like as below:\r\n\r\nThen we drag other measure names into the Marks to enrich the information of each circle.\r\n\r\nAnd your graph should like this:\r\n\r\nNext, we need to add filters into the graph to make it more flexible for viewers. In this step, we want to enable viewers to select different countries and year(s).\r\n\r\nNow viewers can select countries and year(s) they are interested in. Further we will still use filters to switch different charts in dashboard.\r\nWhat’s more, for the clarity, we need to change the opacity of the circle.\r\n\r\nNow the first chart of “General Information” is already completed.\r\n4.3 For the “No. of Conflicts” and “No. of Fatalities” parts\r\nSince the steps are very similar, we put these two sheets in one section. First for the “No. of Conflicts”, we need to create a calculation field to sum the total number of conflicts.\r\n\r\nThen we also put “Longitude” and “Latitude” into columns and rows respectively. Next, we put the calculation field that we just created into color panel and “Country” into lable panel. Your graph should look like this:\r\n\r\nFor the “No. of Fatalities” part we do the same steps except we put “Fatalities” into color panel. And your graph should like this:\r\n\r\nNow we have completed these two parts.\r\n4.4 For the “Conflicts bar chart” and “Fatalities bar chart” parts\r\nThese two graphs are also basically the same so we will do them together. First for the “Conflicts bar chart”, we put the calculation field “sum conflict” and Country into rows while put Years into columns. After that, we drag event type into color panel. In addition, we need to change the format of the country header to make it more clear and change the row title into “Total conflicts”. Now your graph should look like as below:\r\n\r\nFor the “Fatalities bar chart”, we do the same steps except we use “Fatalities” to replace the “sum conflict” in rows. And also we need to change the format of the country headers.\r\n\r\n4.5 Dashboard preparation and design\r\nFor the dashboard, we want to switch different charts through different options and make the filters apply to all the related charts. To achieve this, we need do some preparation before we design the dashboard.\r\nFirst, we need to create a parameter as below to provide different options for the charts.\r\n\r\nThen we need create a calculation field using the parameter we just created. And we name it as “chosen chart”.\r\n\r\nNext, we drag the “chosen chart” into filters panel for all the charts respectively. Importantly we also need to add this filter for “Conflict bar chart” and “Fatalities bar chart” because we want them to appear when “No. of Conflicts” and “No. of Fatalities” are chosen.\r\n\r\n\r\nNow it comes to set the filters to make them apply to related charts. In this case, we want to country filter to apply to “Conflicts bar chart” and “Fatalities bar chart”, and year filter apply to “No. of Conflicts” and “No. of Fatalities”. So we set as below:\r\n\r\n\r\nNow we have completed all the preparation, we can start design the dashboard. First we need to drag the “Vertical” to the dashboard. Then we drag “General Information” sheet into it. Now it appears like this:\r\n\r\nNext we need to hide the title since it is not helpful and will impact other sheets.\r\n\r\nNow the “General Information” part is done, we change the filter to switch to “No. of Conflicts”.\r\n\r\nIn this blank space, we drag the “No. of Conflicts” and “Conflict bar chart” sheets into it like this:\r\n\r\nThen we switch to the “No. of Fatalities” and do the same steps as above. Now we have basically done the design work of our dashboard. You can also do some changes of the layout to make it more clear and comfortable for users.\r\n5. Major Observations\r\n\r\n\r\nFrom this graph we can see that during 2010-2020, the conflicts in South-east Asia mostly happened in Philippines while the most severe conflicts happened in Myanmar. Hence, further we will focus on these two countries since they have the most apparent characteristics. What’s more important, we can discover some regions where conflicts usually happened. For example, the north, east, and west Myanmar that are cloesd to boarders, also south Thailand near to Malaysia and the whole Philippines.\r\n\r\n\r\nFrom this graph we can see that in South-east Asia, conflicts are mainly in Philippines, Myanmar, Thailand, and Indonesia. The rest region has relatively less conflicts and there are no conflicts happened in Singapore between 2010 and 2020.\r\n\r\n\r\nFrom this graph we can see that most fatalities are occurred in Philippines since it has the most conflicts. And the second severest is Myanmar since the scale of the conflict is relatively larger. Except these two countries, the fatalities of rest is much more less.\r\n\r\n\r\n\r\nIn these two charts, we focus on the conflicts and fatalities in Philippines. We can see that for conflicts, there are none conflicts happened, while since 2016, there are a great numbers of conflicts but after 2016 the number is going down. And the main types of the conflicts are violence against civilians and battles. For fatalities, main fatalities is casued by these two types of conflicts.\r\n\r\n\r\n\r\nIn these two charts, we focus on the conflicts and fatalities in Myanmar. We can see that the conflicts trend is unstable and most of the conflicts are battles while in 2017 there are much more violence against civilians than other years. And also we can see that in 2016 despite the number of violence against civilians is low but the fatalities caused is much higher than other events.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-22T01:09:05+08:00",
    "input_file": "dataviz-makeover-03.utf8.md"
  },
  {
    "path": "posts/2021-02-28-project-13-proposal/",
    "title": "Project 13 Proposal",
    "description": "The proposal of group 13.",
    "author": [
      {
        "name": "Tang Haozheng, Lim Jun Jie Timothy, Wu Yufeng",
        "url": {}
      }
    ],
    "date": "2021-02-28",
    "categories": [],
    "contents": "\r\nIntroduction\r\nAround the world, there is always an emphasis on education, for example, to ensure education is available and affordable to all, to improve the method of education. This is because through the study of education, it can be observed that having a good education leads to better general well-being, such as healthier lifestyles, employment opportunities, career progression and lower tendencies to commit crime.\r\nWhile there are many factors that can impact a person’s academic performance, family background and one’s lifestyle are two of the larger factors. The influence of family background may include financial status in the family’s ability to provide educational support, stability at home to provide emotional and mental support, among others. On the other hand, one’s lifestyle choices such as what he or she chooses to do during their free time, amount of time they spend on studying has very direct impact on one’s grades.\r\nMotivation\r\nSince there are many sub-factors in family background and lifestyle choices, the motivation of this study is hence to look deeper at these sub-factors to see which are the factors that have a greater correlation in the impact on a student’s grades.\r\nMore specifically, this study aims to study the correlation between each factor and a student’s grades, as well as aiming to build a model that can accurately determine the academic performance of a student. From the findings, targeted help may be administered to students in these specific areas attributing to poor grades in school, therein helping them have a higher chance of a better future.\r\nData Set and Preparation\r\nThe data set used in this report is from Kaggle, which was obtained from a survey of Portuguese students aged 15 to 22 from mathematics and Portuguese language course. As there were students from attending both courses, these duplicates of 39 entries were removed, leaving a total of 1005 data points. The data was obtained through a survey on family demographics, lifestyle factors, along with their grades in mathematics and Portuguese language. Asides from the school, gender, and age, the other 27 variables can be broadly classified into family demographics and lifestyle factors. In the data set, which is a csv file, the following variables are presented, which will undergo further data cleaning and data preparation for analysis and visualization:\r\n\r\n\r\n\r\nMethodology and Approach\r\nRegression or Decision Tree\r\nSelection based on correlation\r\nFirst, we need to exclude factors with relatively strong positive/negative correlations with absolute value of correlation coefficients greater than 0.7. This is because these factors with strong correlations cause a lower accuracy of our regression model. We will use a correlation matrix to achieve it. Below is an example of testing correlation using correlation matrix in R. In this case, we will use rcorr function in Hmisc package.\r\n\r\n\r\n\r\nLogistic/Multiple Linear Regression or Decision Tree\r\nCurrently we are not sure which model is more suitable for our data. Theoretically, all these three models are applicable for our data. Hence, in this case we decide to conduct these three models above and later we can decide which one to use by comparing R square.\r\nHierarchical Clustering\r\nIn data mining and statistics, hierarchical clustering (also called hierarchical cluster analysis or HCA) is a method of cluster analysis which seeks to build a hierarchy of clusters. In our project, we aim to classify the respondents into different clusters based on their personal information, so that we have a better understanding that which group of students share the similar characteristics. Through hierarchical clustering and dendrogram functions in R, we can get a clear and comprehensible visualization based on the hierarchical clustering algorithm.\r\n\r\n\r\n\r\nEDA Visualizations\r\nBesides the models we plan to use above, we also provide EDA for our project. And the proposed dashboard design is shown as below:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nTimeline\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-28-project-13-proposal/data.png",
    "last_modified": "2021-02-28T22:18:36+08:00",
    "input_file": "project-13-proposal.utf8.md"
  },
  {
    "path": "posts/2021-02-19-dataviz-makeover-02/",
    "title": "DataViz MakeOver 02",
    "description": "DataViz MakeOver 02 of ISSS608 Visual Analytics and Applications",
    "author": [
      {
        "name": "Tang Haozheng",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n1. Critiques For The Original Visualization\r\nThe current visualization can be found at below picture. The purpose of this chart is to compare the attitude towards vaccine against Covid-19 between different countries. And for this purpose, there are sevral improvements.\r\n\r\n1.1 Clarity Issues\r\n(1)For the left chart, the Y axis is sorted alphabetically and it is hard to find out that which country is actually the most pro-vaccine. Since the title of this chart is “Which country is more pro-vaccine?”, at least we need to identify the most pro-vaccine country in this chart.\r\n(2)For the left chart, the entire layout is hard to see the percentage of people of each country that take a supportive attitude, which is more than 3 in this chart, is higher than others. The reason is that the red parts (which indicates 3) of each bar is at different positions and it is hard to compare since the start point is different. To solve this issue, I will later use Gantt chart to fix it since Gantt chart allows all the neutral parts locate at the same position.\r\n(3)For the right chart, it is actually kind of redundant since if we design the left chart properly, viewers can easily find out which country that people from is more pro-vaccine. However, if we consist to keep the right chart, then at least the Y axis of it should be sorted by the same order of the left chart for consistency. This is to say, we should sort both charts alphabetically or by the percentage of strongly agree descendingly. In this case, it is more convenient for viewers to know the rankings and find out more information if they compare these two charts together.\r\n(4)Looking at the legend for the colour, the title is “Vac_1”, this is not understandable for viewers since there is no any other information that clarify what the “Vac_1” refers to.\r\n1.2 Aesthetics Issues\r\n(1)The colour of the left chart could be more contrasting especially for “Strongly disagree” and “Strongly agree”. Besides Green is more associated with supportive attitudes.\r\n(2)The first letter of the country name should be capitalised to make it more formal and rigorous。\r\n(3)There is a typo in the title of the left chart. Need correct “pro-vacinne” to “pro-vaccine”.\r\n2. Proposed Design\r\n\r\n\r\nComparing to the original visualization, the proposed design overcome sevral issues:\r\n(1)More understandable for viewers to find out which country actually ranks higher than others, and it allows viewers to select which question they want to display instead of only one question. This is to enrich the information conveyed to viewers.\r\n(2)Gantt chart makes the neutral parts of each bar, which is with the value of 3, locate at the same position so that it is easier to compare both “Agree & Strongly agree” proportion and “Disagree & Strongly disagree” proportion.\r\n(3)The uncertainty chart displays the percentage of “Agree & Strongly agree” in total records, which is more straightforward for viewers and it provides the confidence interval of population proportion, which is more rational and rigorous by assuming that the samples are normal distributions.\r\n(4)The filters of the uncertainty chart allows viewers to select different questions and break down the data by “Age”, “Gender”, “Employment_Status”, “Household_Size” and “Household_Children”. It conveys more useful information and details to viewers.\r\n3. Tableau Dashboard\r\n\r\n4. Step-by-step Description\r\n4.1 Data Preparation\r\nSince we need to convert the data type of score into numerical datatype, we need to delete the characters in the score data, which means “1 - Strongly agree” need to be “1” and “5 - Strongly disagree” need to be “5”. To do this, I replace these data in the data source. Alternatively, it is possible to create a calculation field in tableau that helps to replace the strings with numbers after importing the data. However, here I chose the less efficient way to do it.\r\n\r\n\r\n4.2 Importing data into Tableau\r\nHere click on “New Union” below and then choose Wildcard(automatic) to import all the data we need as a union.\r\n\r\nThen need to hide the columns that won’t be used further. Here, for questions, I only keep “Vac1”, “Vac2_1”, “Vac2_2”, “Vac2_3”, “Vac2_6”, and “Vac3”. For others, need to keep “Age”, “Gender”, “Employment_status”, “household_size” and “household_children” for further use as breakdown parameters. Then pivot the questions kept and corresponding scores. At last, we input aliases for questions and path(we need to change it to country names).\r\n\r\n\r\nFrom the pictures above, we can see there are some extra columns created. Those will be explained later when we come to create calculation fields.\r\n4.3 Gantt chart\r\nFirst we right click the “Score” and change it to dimension and change the data type to numbers(whole). Then we create the calculation fields we need to use for the chart.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThen we drag the dimensions and measures to the position as shown in below picture.\r\n\r\nNotice that we need to change the “compute using” of “Gantt Percent” and “Percentage” to “Score”. Also at the right colour filter panel, we need to exclude null value so it won’t display.\r\n\r\n\r\nAfter this need to edit the format of axis to make it tidy and understandable. First we need to reverse the x axis since in this data source, 1 represents strongly agree and 5 represents strongly disagree. Then under the format panel, change the scale to percentage with 0 decimal.\r\n\r\n\r\nThen drag the “Questions” to filters panel and set as below:\r\n\r\n\r\nAt last, we input the title and notice we need to insert “Questions” so that our title will change according to the filter.\r\n\r\nNow the chart should look like as below and we have finished the gantt chart part.\r\n\r\n4.4 Uncertainty visualization\r\nFirst of all, we need to group the value of “Age”, “Household_children” and “Household_size” to make them into intervals.\r\n\r\n\r\n\r\nThen we start to create below parameters and calculation fields for uncertainty.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThen we need to drag the measures, dimensions and parameters to the position shown as below. Notice that once we drag the lower limit and upper limit to columns we need to right click Prop and choose dual axis. After that, we right click the upper x axis and choose synchronise axis.\r\n\r\n\r\n\r\n\r\nAt last we input the title and also we need to insert the breakdown parameter and questions filter.\r\n\r\nThen the final chart should look like as below:\r\n\r\n4.5 Dashboard design\r\nFirst create a new dashboard and choose the size of automatic.\r\n\r\nThen we drag sheet 1 and sheet 2 to the blank area and adjust the layout to make it tidy and easily understandable. Especially we need to put the filters for gantt chart and uncertainty chart at different positions next to the corresponding chart to be clearer. Finally our dashboard should look like this.\r\n\r\n5. Major Observations\r\n5.1 Observations from Gantt chart\r\n(1)UK is the most pro-vaccine country under question: If a Covid-19 vaccine were made available to me this week I would definitely get it, according to the gantt chart. On the contrary, France is the most against-vaccine country under question 1.\r\n\r\n(2)Under question: I am worried about getting Covid-19, the top three most worried countries are Japan, South Korea and Singapore. We can see that all of them are Asian countries.\r\n\r\n(3)Interestingly, under question: I am worried about potential side effects of a Covid-19 vaccine, the top 3 countries are also Japan, Singapore and South Korea.\r\n\r\n5.2 Observations from uncertainty chart\r\n(1)Under the question: I am worried about getting Covid-19, as the age group increases, the percentage of “Agree & Strongly agree” is also getting higher accordingly.\r\n\r\n(2)Under question: If a Covid-19 vaccine were made available to me this week I would definitely get it, the male is more willing to be vaccinated than the female.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-28T22:17:46+08:00",
    "input_file": "dataviz-makeover-02.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Tang Haozheng",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-05T12:52:29+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-02-05-dataviz-makeover-01/",
    "title": "DataViz MakeOver 01",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Tang Haozheng",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-05",
    "categories": [],
    "contents": "\r\nCritiques For The Original Visualization\r\nThe current visualization can be found at Chart 6 Resident labour force by age in MOM’s Report: Labour Force in Singapore 2019 to indetify possible areas of improvement.  1.1 Clarity Issues\r\n(1)The information of axis below is inconvenient to combine with the line in the graph. Since the X axis is intervals and the graph is based on lines, it is hard to know which point of the line refers to the axis below. In this case, a bar chart maybe a better option to matach the information more clearly.\r\n(2)The upper paragraph reveals some insights and trends of the chart. For instance, it said that the share of residents aged 55 & over rose from 16% in 2009 to 25% in 2019. However, it is not so straightforward for readers because they have to add the data up by themselves.\r\n(3)The title of the chart is “Resident labour force by age”. For the information that we can tell from this chart, this title is too general to convey the exact information. “Resident labour force by age” may want to show that the numbers of labour in different age groups, not exactly the labour participation rate in different age groups.\r\n(4)The note below is not so conspicuous for readers, and this may cause confusion since the sum of the data is not exact 100.\r\n1.2 Aesthetics Issues\r\n(1)The colour is not so conspicuous to catch readers’ eyes. And also can not tell which information is more important than others through this colour setting.\r\n(2)The “Percent” is under the title, which should be added right next to the axis.\r\n(3)Too much words in the middle of the chart, which is distracting and confusing.\r\nProposed Design  Comparing to the original chart, the first barchart is more clear to refer the data to the interval since they are barcharts, and also the tag on each bar can tell the exact value so there is no need to read other tables. Also the bars in each interval is easier to compare the difference since there is no longger lines in the chart. What’s more, I’ll add colour on the bars to indicate whether the difference between 2009 and 2019 is postivie or not, and increase/decrease by what degree, which can be told by the drakness of the colour(i.e. If the difference is larger, the colour will be darker). The second chart is to tell the difference and changes based on sex factor. Through this chart, readers can easily know that which the participation rate structures of the age groups are actually changing.\r\nStep-by-step Description\r\n3.1 Data Preparation Initially, the data was designed to be shown in Excel, so we need to do some transformations of the format in order that this file can be loaded properly by Tableau. And the data after reorganization are as below: \r\n3.2 Import file into Tableau After loading this revised data into Tableau, there are two sheets will be used in future charts. And I combined these two sheets with “Age” relationship. \r\n3.3 Sheet 1 Side-by-side Barchart For the total Resident Labour Participation Rate, I use the side-by-side barchart and put data in 2009 and 2019 together to condust the comparison. The whole structure of the chart is as below:  Furthermore, I created a calculated field to get the difference of data between 2009 and 2019 to provide a more straightforward way for readers to catch the information. The calculated field is written as below:  Then I put the “Difference” into colour panel to filter the chart. Also the colour panel needs to be set as 0 centric since we are concerned about if the difference is positive or negative.  I also set the colour steps as 10 to make it more clear that which age groups actually has the most changes in the participation rate.\r\n3.4 Sheet 2 Horizontal Barchart The second sheet is to better reveal the difference of Labour Force Participation Rate between males and females in both 2009 and 2019. The structure is as below:  I put the data in 2009 and 2019 together then chose Horizontal Barchart, and reverse the left part of the chart and switch off the Stack Marks. Then need to put “Sex” into colour panel to differentiate data in males and females. After that, to make it more convenient to read, I create a calculated field edited as below in order to build a new horizontal axis in the middle of the chart:  Then I drag this “Axis” into column field and put it between SUM(2009) and SUM(2019). Next, in “Axis” panel, I put the “Age” into Text to make this axis the same as original Y axis.  The last step is to switch off the “show header” function under “Age” in column field.\r\n3.5 The Dashboard\r\nTo present these two charts, I create a dashboard to put them together for better reading experince, and the layout is as below: \r\nMajor Observations\r\nIn Total Resident Labour Force Participation Rate in 2009 and 2019:\r\n(1)Age group 20-24 is the only one that the rate in 2019 is lower than the one in 2009.\r\n(2)Age group 60-64 and 65-69 have the largest difference in 2009 and 2019, and both of them is increased by more than 10 percent.\r\n(3)According to the above observations, it seems that young labour force participation rate is slightly decreased or keep the same while elder one has a much apparent increasing trend.\r\nIn Resident Labour Force Participation Rate By Age and Group in 2009 and 2019:\r\n(1)The female participation rate in age group 20-24 is the only one that is higher than males.\r\n(2)Overall, the female participation rate increased more than males, which means more female are actually going to work in the past decade in 2019.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-05T13:09:03+08:00",
    "input_file": "dataviz-makeover-01.utf8.md"
  }
]
